АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/алк_ТранспортировкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ТранспортировкаЗапасов</name>
  <basedOn>Document.алк_РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОтгрузкиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.алк_ТоварыВПути</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ОтгрузкаРН</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрОтправитель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрПолучатель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспорта</name>
    <type>
      <types>EnumRef.алк_ВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Пломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОнЖе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможняДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Мультизаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКУчету_ТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешиванииВПорту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорученияЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесКонтейнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПорту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПортуДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задекларирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИдентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизит</name>
    <attributes>
      <name>УпакРеквизит</name>
      <type>
        <types>CatalogRef.алк_Реквизит</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.алк_РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗаказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/РФП_ИзмененияЗапрещены/РФП_ИзмененияЗапрещены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РФП_ИзмененияЗапрещены</name>
  <resources>
    <name>ИзмененияЗапрещены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/ObjectModule.bsl
#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		Заказ = ДанныеЗаполнения.Заказ;	
	КонецЕсли; 
	
	Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
		ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик заполнения документа на основании Приходной накладной.
//
// Параметры:
//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
//
Процедура ЗаполнитьПоРасходнойНакладной(ДанныеЗаполнения, Операция = "") Экспорт
	
	Комментарий  = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Комментарий), "#" + ДанныеЗаполнения.Комментарий + ";", "");
	
	//ИспользоватьАддедндумы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Участок, "ИспользуютсяАддендумы") = Истина);
	//Если ИспользоватьАддедндумы тогда
	Мультизаказ = Истина;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,СтрокаИДКонтейнеров,ДопАналитика,Участок,Заказ");
	
	ДокументыОснования.Очистить();
	СтрокаДокОснования = ДокументыОснования.Добавить();
	СтрокаДокОснования.ДокументОснование = ДанныеЗаполнения.Ссылка;
	
	ТоварыДляЗаполнения = Документы.алк_ТранспортировкаЗапасов.ПолучитьДанныеЗаполненияТабличнойЧастиЗапасы(
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаполнения.Ссылка));
	Запасы.Загрузить(ТоварыДляЗаполнения);
	//Иначе
	//	// Заполнение шапки документа.
	//	ДокументОснование = ДанныеЗаполнения.Ссылка;
	//	Организация = ДанныеЗаполнения.Организация;
	//	Заказ = ДанныеЗаполнения.Заказ;
	//	Направление = ДанныеЗаполнения.Направление; 
	//	Участок = ДанныеЗаполнения.Участок;
	//	СтрокаИДКонтейнеров = ДанныеЗаполнения.СтрокаИДКонтейнеров;
	//	ДопАналитика = ДанныеЗаполнения.ДопАналитика;
	//	
	//	
	//	Для Каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
	//		
	//		НоваяСтрока = Запасы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗапасы, "КоличествоПакетов,Номенклатура,СерийныйНомер");
	//		НоваяСтрока.КоличествоПакетов = ТекСтрокаЗапасы.КоличествоПакетов;
	//		НоваяСтрока.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
	//		НоваяСтрока.СерийныйНомер = ТекСтрокаЗапасы.СерийныйНомер;
	//		
	//		ПараметрыП = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(ТекСтрокаЗапасы.СерийныйНомер);
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыП);
	//		
	//		НоваяСтрока.ОбъемТаможня = Окр(НоваяСтрока.ОбъемТаможня, 2);
	//		
	//		НоваяСтрока.НомерСерии = ПараметрыП.НомерПакета;
	//		НоваяСтрока.ВесНетто   = ПараметрыП.ВесНеттоТаможня;
	//		НоваяСтрока.ВесБрутто  = ПараметрыП.ВесБруттоТаможня;
	//		
	//		НоваяСтрока.Заказ      = Заказ;
	//		
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

// Обработчик заполнения на основании данных заполнения.
//
// Параметры:
//  ДанныеЗаполнения - Структура.
//
Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ОнЖе = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗапасыПоТЧДокументыОснования();
	
КонецПроцедуры

Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	Запасы.Очистить();
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_РасходнаяНакладная") Тогда
		
		ЗаполнитьПоРасходнойНакладной(ДокументОснование);
		
	КонецЕсли
	
	
КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()


#КонецОбласти


#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			
			Если Не ЭтотОбъект.ДокументОснование.Проведен  Тогда
				Сообщить("Вы не можете создавать документ на основании не проведенного документа. Проведите Расходную накладную!");
				Возврат;
			КонецЕсли;	
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_РасходнаяНакладная") тогда			
		Если ДанныеЗаполнения.Проведен  Тогда
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
		Иначе
			Сообщить("Вы не можете создавать документ на основании не проведенного документа. Проведите Расходную накладную!");
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_РасходнаяНакладная") Тогда
		
		СписокПодчиненных = ПолучитьПодчиненныеОснованию();
		
		Сообщение = Новый СообщениеПользователю;
		
		СсылкиСообщение = "";
		Для каждого СсылкаПодч Из СписокПодчиненных Цикл
			
			Если ТипЗнч(СсылкаПодч.Значение) = Тип("ДокументСсылка.алк_ТранспортировкаЗапасов") Тогда
				СсылкиСообщение = СсылкиСообщение + ?(СсылкиСообщение = "", "", Символы.ВК) + СсылкаПодч.Значение;
				Отказ = Истина;
			КонецЕсли; 
			
			Если Отказ Тогда
				Сообщение.Текст = "В базе есть документы ""Транспортировка запасов"", подчененные РН: "
				+ ДокументОснование + Символы.ВК 
				+ "   - " + СсылкиСообщение + Символы.ВК + "Запись документа невозможна!";
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияЗапрещены = РегистрыСведений.РФП_ИзмененияЗапрещены.ПолучитьСостояниеИзмененияЗапрещены(Ссылка);
	
	Если ИзмененияЗапрещены Тогда
		Отказ = Истина; 
		Сообщить("Ошибка! Включите возможность изменения документа.");
		Возврат;
	КонецЕсли;
	
	//Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		//ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена);
		
		ПараметрыСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Смена,ДатаСмены);		
		
		Дата = ПараметрыСмены.ДатаВремяКонцаСмены - 10; //РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
		
	//КонецЕсли; 
	
	ОбъемДокумента = Запасы.Итог("Объем");
	ОбъемТаможняДокумента = Запасы.Итог("ОбъемТаможня");
	
	СерийныеНомера = Запасы.Выгрузить(,"СерийныйНомер").ВыгрузитьКолонку("СерийныйНомер");
	СерийныеНомера = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СерийныеНомера);
	КоличествоПакетовДокумента = СерийныеНомера.Количество();
	
	//Если ВыгружатьВ_ТД И Не ЗначениеЗаполнено(ДатаКУчету_ТД) Тогда
	//	ДатаКУчету_ТД = Дата;		
	//КонецЕсли; 
	
	Если Дата > ДатаКУчету_ТД И ЗначениеЗаполнено(ДатаКУчету_ТД) Тогда 
		
		Сообщить("Дата к учету ТД меньше даты документа! Проверьте заполнение!");	
	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ДокументыОснования.Количество() > 0 тогда
		Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументыОснования[0].ДокументОснование, "Заказ" );
		ДополнительныеСвойства.Вставить("ИспользоватьАддендумы", ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Соберем массив для контроля остатков  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель
			|ИЗ
			|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|	И алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
			
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		ДополнительныеСвойства.Вставить("КонтролироватьОстаткиНаДатуДокумента",Ложь);
		
	КонецЕсли;
	
	Если НЕ Мультизаказ Тогда
		ДокументыОснования.Очистить();
		СтрокаТЧОснования = ДокументыОснования.Добавить();
		СтрокаТЧОснования.ДокументОснование = ДокументОснование;  
	КонецЕсли;
	
	//Проверка, что у транспортировки запасов совпадает дата смены и смена с расходной  
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДокументыОснования.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	Для Каждого эл ИЗ ДокументыОснования Цикл
		Расходная = эл.ДокументОснование;
		Если Расходная.ДатаСмены <> ДатаСмены ИЛИ Расходная.Смена <> Смена Тогда 
			
			Если Расходная.ДатаСмены <> ДатаСмены И Расходная.Смена <> Смена Тогда 
				Сообщить(СтрШаблон("В документе %1 и транспортировке не совпадают даты смен и смены!",Строка(Расходная)));
			Иначе  
				Если ДатаСмены <> Расходная.ДатаСмены Тогда  
					Сообщить(СтрШаблон("В документе %1 и транспортировке не совпадают даты смен!",Строка(Расходная))); 
				КонецЕсли;
				
				Если Смена <> Расходная.Смена  Тогда
					Сообщить(СтрШаблон("В документе %1 и транспортировке не совпадают смены!",Строка(Расходная))); 
				КонецЕсли;	
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЕсли;
	КонецЦикла; 
	
	//Проверка, что заказы в документах основания и запасах совпадают
	Таб = Запасы.Выгрузить();
	Таб.Свернуть("Заказ",);  
	
	Если Таб.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КолЗаказ = 0;
	Соответсвие = 0;
	Если ЗначениеЗаполнено(Таб[0].Заказ) Тогда  
		Для Каждого Строка Из Таб Цикл    
			КолЗаказ = КолЗаказ + 1;
			Для Каждого Док ИЗ ДокументыОснования Цикл 
				Если Строка.Заказ = Док.ДокументОснование.Заказ Тогда
					Соответсвие = Соответсвие + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если КолЗаказ <> Соответсвие И  КолЗаказ > 0 Тогда  
		Сообщить("Заказы в таблицах Расходные накладные и Продукция не совпадают!");	
		Отказ = Истина;
	    КонецЕсли;	
	КонецЕсли;

	//\\
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
	
	// Отражение в разделах учета
	НовыйМеханизмПроведения = Ложь;
	
	МассивНоменклатуры = Запасы.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатуры);
	
	Если ДополнительныеСвойства.Свойство("ИспользоватьАддендумы") Тогда
		НовыйМеханизмПроведения = ДополнительныеСвойства.ИспользоватьАддендумы;
	КонецЕсли;

	Если НовыйМеханизмПроведения Тогда
		Документы.алк_ТранспортировкаЗапасов.КонтрольСоответствияЗапасовОснованиям(Ссылка, Отказ);  	
	КонецЕсли; 
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.алк_ТранспортировкаЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	//ДополнительныеСвойства.ДляПроведения.Вставить("Номенклатура", МассивНоменклатуры);
	
	Если Не НовыйМеханизмПроведения тогда
		//РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьВыполнениеЗаказовЭтапыСерии(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьДвиженияПоОсткамПоЗаказам(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. Оборотный регистр ++
		РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ); 
		//Сергеева Г.О. Оборотный регистр --
			
		РфпСервер.ОтразитьОстаткиТоварыВПути(ДополнительныеСвойства, Движения, Отказ); 
		
		// СерийныеНомера
		УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	РфпСервер.ОтразитьОтгрузкуРН(ДополнительныеСвойства, Движения, Отказ);
	
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда  
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);  // товары не переданные на ТД (в ЖД тупике) и в порту   
	КонецЕсли;
	
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВРегистрТоварыВПуи(Дата) Тогда  
		РфпСервер.ОтразитьОстаткиТоварыВПути(ДополнительныеСвойства, Движения, Отказ);  
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
	
	//ПРОВЕРКА
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение); 
	//\\
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)   
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства); 
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);  
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
	
КонецПроцедуры

#КонецОбласти


#Область Служебные

Функция ПолучитьПодчиненныеОснованию()
	
	СписокСсылок = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДокументОснование = &ДокументОснование
	|	И алк_ТранспортировкаЗапасов.Ссылка <> &Ссылка
	|	И алк_ТранспортировкаЗапасов.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат СписокСсылок;
	
КонецФункции	



#КонецОбласти 


#Область КонтрольПроведения

Функция КонтрольПоДокументуОснования()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_РасходнаяНакладнаяЗапасы.СерийныйНомер,
	|	1 КАК КоличествоОснование,
	|	0 КАК Количество
	|ПОМЕСТИТЬ втДокументОснование
	|ИЗ
	|	Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка = &ДокументОснование
	|	И алк_РасходнаяНакладнаяЗапасы.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	0 КАК КоличесвтоОснование,
	|	1 КАК Количество
	|ПОМЕСТИТЬ втТранспортировка
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументОснование.СерийныйНомер,
	|	втДокументОснование.КоличествоОснование КАК КоличествоОснование,
	|	втДокументОснование.Количество КАК Количество
	|ПОМЕСТИТЬ втОбъединение
	|ИЗ
	|	втДокументОснование КАК втДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТранспортировка.СерийныйНомер,
	|	втТранспортировка.КоличесвтоОснование,
	|	втТранспортировка.Количество
	|ИЗ
	|	втТранспортировка КАК втТранспортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатОбъединения.СерийныйНомер,
	|	РезультатОбъединения.КоличествоОснование,
	|	РезультатОбъединения.Количество,
	|	РезультатОбъединения.КоличествоОснование - РезультатОбъединения.Количество КАК КонтрольнаяСумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		втОбъединение.СерийныйНомер КАК СерийныйНомер,
	|		СУММА(втОбъединение.КоличествоОснование) КАК КоличествоОснование,
	|		СУММА(втОбъединение.Количество) КАК Количество
	|	ИЗ
	|		втОбъединение КАК втОбъединение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втОбъединение.СерийныйНомер) КАК РезультатОбъединения
	|ГДЕ
	|	РезультатОбъединения.КоличествоОснование - РезультатОбъединения.Количество <> 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Состав номенклатуры документа не соответствует документу основанию! Перезаполните по основанию.";
		Сообщение.Сообщить(); 
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли;
	
	Возврат  Отказ;
	
КонецФункции

#КонецОбласти
